DataProcessors/питЗагрузкаИзДанныхПродажФронта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>питЗагрузкаИзДанныхПродажФронта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассовыйУзел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.питУдаленныеКассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаОтбора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаКонцаОтбора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЦелевыхДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппироватьПоНомеруСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходящаяСмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейВпередДляАнализаПерехода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейНазадДляАнализаПерехода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>удалитьУчитыватьВозвратыПриЗагрузкеПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдминистративныйРежимПерезагрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФиксированнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПараметрыКасс</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КассаККМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДанныеМодифицированы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СпособОпределенияСкладаПриготовления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СпособОпределенияСкладаРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СкладПриготовления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СкладРеализации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗагрузкаДанныхПродажВПроизводственныеДокументы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УчитыватьОстаткиБлюдНаСкладе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроводитьЗагружаемыеДокументы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗапретитьПовторнуюЗагрузкуДанныхПродаж</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РазрешитьНедовложения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗагружатьТоварыВВыпускСПеремещением</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОрганизацияЦелевыхДокументовИзКассыККМ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОрганизацияКассовогоУзла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УчитыватьВозвратыПриЗагрузкеПродаж</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПодразделениеКассовогоУзла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УменьшатьСуммыТоваровНаСуммуБонусов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОформлятьДокументыИСМП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОформлятьДокументыЕГАИС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/питУчетДанныхПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>питУчетДанныхПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассовыйУзел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.питУдаленныеКассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.питДанныеПродажФронта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПриемник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбновленПриемник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/питЗагрузкаИзДанныхПродажФронта/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ЗарегистрироватьИзмененияДанныхПродажФронта(МассивРегистраторов, ТекстОшибки = "") Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	питДанныеПродажФронта.Ссылка КАК ДокументРегистратор,
	|	ЕСТЬNULL(питУчетДанныхПродаж.ДокументПриемник, НЕОПРЕДЕЛЕНО) КАК ДокументПриемник,
	|	ЛОЖЬ КАК ОбновленПриемник,
	|	ЕСТЬNULL(питУчетДанныхПродаж.Дата, НАЧАЛОПЕРИОДА(питДанныеПродажФронта.Дата, ДЕНЬ)) КАК Дата,
	|	питДанныеПродажФронта.КассовыйУзел КАК КассовыйУзел
	|ПОМЕСТИТЬ ОсновныеРегистраторы
	|ИЗ
	|	Документ.питДанныеПродажФронта КАК питДанныеПродажФронта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.питУчетДанныхПродаж КАК питУчетДанныхПродаж
	|		ПО питДанныеПродажФронта.Ссылка = питУчетДанныхПродаж.ДокументРегистратор
	|ГДЕ
	|	питДанныеПродажФронта.Ссылка В(&Регистраторы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питУчетДанныхПродаж.ДокументРегистратор КАК ДокументРегистратор,
	|	питУчетДанныхПродаж.ДокументПриемник КАК ДокументПриемник,
	|	ЛОЖЬ КАК ОбновленПриемник,
	|	питУчетДанныхПродаж.Дата КАК Дата,
	|	питУчетДанныхПродаж.КассовыйУзел КАК КассовыйУзел
	|ПОМЕСТИТЬ ДополнительныеРегистраторы
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК питУчетДанныхПродаж
	|ГДЕ
	|	НЕ питУчетДанныхПродаж.ДокументРегистратор В (&Регистраторы)
	|	И питУчетДанныхПродаж.ДокументПриемник В
	|			(ВЫБРАТЬ
	|				ОсновныеРегистраторы.ДокументПриемник
	|			ИЗ
	|				ОсновныеРегистраторы КАК ОсновныеРегистраторы
	|			ГДЕ
	|				ОсновныеРегистраторы.ДокументПриемник <> НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеРегистраторы.ДокументРегистратор КАК ДокументРегистратор,
	|	ОсновныеРегистраторы.ДокументПриемник КАК ДокументПриемник,
	|	ОсновныеРегистраторы.ОбновленПриемник КАК ОбновленПриемник,
	|	ОсновныеРегистраторы.Дата КАК Дата,
	|	ОсновныеРегистраторы.КассовыйУзел КАК КассовыйУзел
	|ПОМЕСТИТЬ РегистраторыПриемники
	|ИЗ
	|	ОсновныеРегистраторы КАК ОсновныеРегистраторы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеРегистраторы.ДокументРегистратор,
	|	ДополнительныеРегистраторы.ДокументПриемник,
	|	ДополнительныеРегистраторы.ОбновленПриемник,
	|	ДополнительныеРегистраторы.Дата,
	|	ДополнительныеРегистраторы.КассовыйУзел
	|ИЗ
	|	ДополнительныеРегистраторы КАК ДополнительныеРегистраторы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питУчетДанныхПродаж.ДокументРегистратор КАК ДокументРегистратор,
	|	питУчетДанныхПродаж.ДокументПриемник КАК ДокументПриемник,
	|	питУчетДанныхПродаж.ОбновленПриемник КАК ОбновленПриемник,
	|	питУчетДанныхПродаж.Дата КАК Дата,
	|	питУчетДанныхПродаж.КассовыйУзел КАК КассовыйУзел
	|ПОМЕСТИТЬ ДополнительныеРегистраторыПриемники
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК питУчетДанныхПродаж
	|ГДЕ
	|	НЕ питУчетДанныхПродаж.ДокументРегистратор В
	|				(ВЫБРАТЬ
	|					РегистраторыПриемники.ДокументРегистратор
	|				ИЗ
	|					РегистраторыПриемники КАК РегистраторыПриемники)
	|	И (питУчетДанныхПродаж.Дата, питУчетДанныхПродаж.КассовыйУзел) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РегистраторыПриемники.Дата,
	|				РегистраторыПриемники.КассовыйУзел
	|			ИЗ
	|				РегистраторыПриемники КАК РегистраторыПриемники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистраторыПриемники.ДокументРегистратор КАК ДокументРегистратор,
	|	РегистраторыПриемники.ДокументПриемник КАК ДокументПриемник,
	|	РегистраторыПриемники.ОбновленПриемник КАК ОбновленПриемник,
	|	РегистраторыПриемники.Дата КАК Дата,
	|	РегистраторыПриемники.КассовыйУзел КАК КассовыйУзел
	|ПОМЕСТИТЬ ОсновнаяТаблица
	|ИЗ
	|	РегистраторыПриемники КАК РегистраторыПриемники
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеРегистраторыПриемники.ДокументРегистратор,
	|	ДополнительныеРегистраторыПриемники.ДокументПриемник,
	|	ДополнительныеРегистраторыПриемники.ОбновленПриемник,
	|	ДополнительныеРегистраторыПриемники.Дата,
	|	ДополнительныеРегистраторыПриемники.КассовыйУзел
	|ИЗ
	|	ДополнительныеРегистраторыПриемники КАК ДополнительныеРегистраторыПриемники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновнаяТаблица.ДокументРегистратор КАК ДокументРегистратор,
	|	ОсновнаяТаблица.ДокументПриемник КАК ДокументПриемник,
	|	ОсновнаяТаблица.ОбновленПриемник КАК ОбновленПриемник,
	|	ОсновнаяТаблица.Дата КАК Дата,
	|	ОсновнаяТаблица.КассовыйУзел КАК КассовыйУзел
	|ИЗ
	|	ОсновнаяТаблица КАК ОсновнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновнаяТаблица.ДокументРегистратор,
	|	ОсновнаяТаблица.ДокументПриемник,
	|	ОсновнаяТаблица.ОбновленПриемник,
	|	ОсновнаяТаблица.Дата,
	|	ОсновнаяТаблица.КассовыйУзел
	|ИТОГИ ПО
	|	КассовыйУзел,
	|	Дата";
	Запрос.УстановитьПараметр("Регистраторы", МассивРегистраторов);
	
	НовыйМассивРегистраторов = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаКассовыхУзлов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКассовыхУзлов.Следующий() Цикл
			
			ВыборкаДат = ВыборкаКассовыхУзлов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
			Пока ВыборкаДат.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.питУчетДанныхПродаж.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.КассовыйУзел.Установить(ВыборкаДат.КассовыйУзел);
				НаборЗаписей.Отбор.Дата.Установить(ВыборкаДат.Дата);
				
				Выборка = ВыборкаДат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Запись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(Запись, Выборка);
					
					НовыйМассивРегистраторов.Добавить(Выборка.ДокументРегистратор);
				КонецЦикла;
				Попытка
					НаборЗаписей.Записать(Истина);
				Исключение
					ТекстОшибки = ИнформацияОбОшибке().Описание;
					ТекстОшибки = "Ошибка регистрации изменений чеков общепита: " + ТекстОшибки + Символы.ВК + "(Имя модуля: " + ИнформацияОбОшибке().ИмяМодуля + ", " 
					+ Символы.ВК + "номер строки: " + ИнформацияОбОшибке().НомерСтроки + ")"; 
					ЗаписьЖурналаРегистрации("Обработка.питЗагрузкаИзДанныхПродажФронта", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
					Возврат НовыйМассивРегистраторов;
				КонецПопытки;
				
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат НовыйМассивРегистраторов;
	
КонецФункции

Процедура ЗарегистрироватьИзменениеЦелевыхДокументов(ТаблицаСоответствияРегистратораИДокумента, МассивОбработанныхДокументов, МассивУдаленныхДокументов) Экспорт
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСоответствия.ЦелевойДокументСсылка КАК ДокументПриемник,
	|	ВЫРАЗИТЬ(ТаблицаСоответствия.ДокументРегистратор КАК Документ.питДанныеПродажФронта) КАК ДокументРегистратор
	|ПОМЕСТИТЬ ТаблицаСоответствия
	|ИЗ
	|	&ТаблицаСоответствия КАК ТаблицаСоответствия
	|ГДЕ
	|	ТаблицаСоответствия.ЦелевойДокументСсылка В(&МассивОбработанныхДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСоответствия.ДокументПриемник КАК ДокументПриемник,
	|	ТаблицаСоответствия.ДокументРегистратор КАК ДокументРегистратор,
	|	ИСТИНА КАК ОбновленПриемник,
	|	&ТекущаяДата КАК ДатаПоследнегоОбновления,
	|	ЕСТЬNULL(УчетДанныхПродаж.Дата, НАЧАЛОПЕРИОДА(ТаблицаСоответствия.ДокументРегистратор.Дата, ДЕНЬ)) КАК Дата,
	|	ЕСТЬNULL(УчетДанныхПродаж.КассовыйУзел, ТаблицаСоответствия.ДокументРегистратор.КассовыйУзел) КАК КассовыйУзел
	|ПОМЕСТИТЬ РегистраторыПриемники
	|ИЗ
	|	ТаблицаСоответствия КАК ТаблицаСоответствия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.питУчетДанныхПродаж КАК УчетДанныхПродаж
	|		ПО ТаблицаСоответствия.ДокументПриемник = УчетДанныхПродаж.ДокументПриемник
	|			И ТаблицаСоответствия.ДокументРегистратор = УчетДанныхПродаж.ДокументРегистратор
	|ГДЕ
	|	ТаблицаСоответствия.ДокументПриемник <> НЕОПРЕДЕЛЕНО
	|	И НЕ ТаблицаСоответствия.ДокументПриемник ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питУчетДанныхПродаж.ДокументРегистратор КАК ДокументРегистратор,
	|	питУчетДанныхПродаж.ДокументПриемник КАК ДокументПриемник,
	|	питУчетДанныхПродаж.ОбновленПриемник КАК ОбновленПриемник,
	|	питУчетДанныхПродаж.ДатаПоследнегоОбновления КАК ДатаПоследнегоОбновления,
	|	питУчетДанныхПродаж.Дата КАК Дата,
	|	питУчетДанныхПродаж.КассовыйУзел КАК КассовыйУзел
	|ПОМЕСТИТЬ ДополнительныеРегистраторыПриемники
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК питУчетДанныхПродаж
	|ГДЕ
	|	НЕ питУчетДанныхПродаж.ДокументРегистратор В
	|				(ВЫБРАТЬ
	|					РегистраторыПриемники.ДокументРегистратор
	|				ИЗ
	|					РегистраторыПриемники КАК РегистраторыПриемники)
	|	И (питУчетДанныхПродаж.Дата, питУчетДанныхПродаж.КассовыйУзел) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РегистраторыПриемники.Дата,
	|				РегистраторыПриемники.КассовыйУзел
	|			ИЗ
	|				РегистраторыПриемники КАК РегистраторыПриемники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	питУчетДанныхПродаж.ДокументПриемник КАК ДокументПриемник,
	|	питУчетДанныхПродаж.Дата КАК Дата,
	|	питУчетДанныхПродаж.КассовыйУзел КАК КассовыйУзел
	|ПОМЕСТИТЬ ПриемникиДляУдаления
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК питУчетДанныхПродаж
	|ГДЕ
	|	питУчетДанныхПродаж.ДокументРегистратор В
	|			(ВЫБРАТЬ
	|				РегистраторыПриемники.ДокументРегистратор
	|			ИЗ
	|				РегистраторыПриемники КАК РегистраторыПриемники)
	|	И НЕ питУчетДанныхПродаж.ДокументПриемник В
	|				(ВЫБРАТЬ
	|					РегистраторыПриемники.ДокументПриемник
	|				ИЗ
	|					РегистраторыПриемники КАК РегистраторыПриемники)
	|	И ЕСТЬNULL(питУчетДанныхПродаж.ДокументПриемник, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО
	|	И (питУчетДанныхПродаж.Дата, питУчетДанныхПродаж.КассовыйУзел) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РегистраторыПриемники.Дата,
	|				РегистраторыПриемники.КассовыйУзел
	|			ИЗ
	|				РегистраторыПриемники КАК РегистраторыПриемники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистраторыПриемники.ДокументРегистратор КАК ДокументРегистратор,
	|	РегистраторыПриемники.ДокументПриемник КАК ДокументПриемник,
	|	РегистраторыПриемники.ОбновленПриемник КАК ОбновленПриемник,
	|	РегистраторыПриемники.ДатаПоследнегоОбновления КАК ДатаПоследнегоОбновления,
	|	РегистраторыПриемники.Дата КАК Дата,
	|	РегистраторыПриемники.КассовыйУзел КАК КассовыйУзел
	|ПОМЕСТИТЬ ОсновнаяТаблица
	|ИЗ
	|	РегистраторыПриемники КАК РегистраторыПриемники
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеРегистраторыПриемники.ДокументРегистратор,
	|	ДополнительныеРегистраторыПриемники.ДокументПриемник,
	|	ДополнительныеРегистраторыПриемники.ОбновленПриемник,
	|	ДополнительныеРегистраторыПриемники.ДатаПоследнегоОбновления,
	|	ДополнительныеРегистраторыПриемники.Дата,
	|	ДополнительныеРегистраторыПриемники.КассовыйУзел
	|ИЗ
	|	ДополнительныеРегистраторыПриемники КАК ДополнительныеРегистраторыПриемники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновнаяТаблица.ДокументРегистратор КАК ДокументРегистратор,
	|	ОсновнаяТаблица.ДокументПриемник КАК ДокументПриемник,
	|	ОсновнаяТаблица.ОбновленПриемник КАК ОбновленПриемник,
	|	ОсновнаяТаблица.ДатаПоследнегоОбновления КАК ДатаПоследнегоОбновления,
	|	ОсновнаяТаблица.Дата КАК Дата,
	|	ОсновнаяТаблица.КассовыйУзел КАК КассовыйУзел
	|ИЗ
	|	ОсновнаяТаблица КАК ОсновнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновнаяТаблица.ДокументРегистратор,
	|	ОсновнаяТаблица.ДокументПриемник,
	|	ОсновнаяТаблица.ОбновленПриемник,
	|	ОсновнаяТаблица.ДатаПоследнегоОбновления,
	|	ОсновнаяТаблица.Дата,
	|	ОсновнаяТаблица.КассовыйУзел
	|ИТОГИ ПО
	|	КассовыйУзел,
	|	Дата");
	Запрос.УстановитьПараметр("ТаблицаСоответствия",ТаблицаСоответствияРегистратораИДокумента);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("МассивОбработанныхДокументов", МассивОбработанныхДокументов);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаКассовыхУзлов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКассовыхУзлов.Следующий() Цикл
			
			ВыборкаДат = ВыборкаКассовыхУзлов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
			Пока ВыборкаДат.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.питУчетДанныхПродаж.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.КассовыйУзел.Установить(ВыборкаДат.КассовыйУзел);
				НаборЗаписей.Отбор.Дата.Установить(ВыборкаДат.Дата);
				
				Выборка = ВыборкаДат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Запись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(Запись, Выборка);
					
				КонецЦикла;
				
				Попытка
					НаборЗаписей.Записать(Истина);
				Исключение
					ОтменитьТранзакцию();
					ТекстСообщения = ОписаниеОшибки();
					ЗаписьЖурналаРегистрации("ЗагрузкаИзДанныхПродаж", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
				КонецПопытки;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	// Удалим целевые документы
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриемникиДляУдаления.ДокументПриемник
	|ИЗ
	|	ПриемникиДляУдаления КАК ПриемникиДляУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокументОбъект = Выборка.ДокументПриемник.ПолучитьОбъект();
		Исключение
			Продолжить;
		КонецПопытки;

		//<< Ефимова Т.В., 19.10.2022, SD101396, доработка 
		Если ДокументОбъект = неопределено тогда
			Продолжить;
		КонецЕсли;
		//>>  
		
		ДокументОбъект.ПометкаУдаления = Истина;
		Попытка
			Если ДокументОбъект.Проведен Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Иначе
				ДокументОбъект.Записать();
			КонецЕсли;
			МассивУдаленныхДокументов.Добавить(ДокументОбъект.Ссылка);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ "+ДокументОбъект+" помечен на удаление";
			Сообщение.Сообщить();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ЗагрузкаИзДанныхПродаж", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры


Функция ДополнитьЧекиСвязаннымиПоЦелевым(МассивСозданныхДокументов) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УчетДанныхПродаж.ДокументПриемник КАК ДокументПриемник
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК УчетДанныхПродаж
	|ГДЕ
	|	УчетДанныхПродаж.ДокументРегистратор В(&СписокРегистраторов)
	|	И НЕ УчетДанныхПродаж.ДокументПриемник В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Документ.питВыпускБлюд.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетДанныхПродаж.ДокументПриемник");
	СписокРегистраторов = Новый СписокЗначений;
	СписокРегистраторов.ЗагрузитьЗначения(МассивСозданныхДокументов);
	Запрос.УстановитьПараметр("СписокРегистраторов",СписокРегистраторов);
	МассивЦелевыхДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументПриемник");
	СписокЦелевыхДокументов = Новый СписокЗначений;
	СписокЦелевыхДокументов.ЗагрузитьЗначения(МассивЦелевыхДокументов);
	
	// Найдем все регистраторы, связанные с этими целевыми документами
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УчетДанныхПродаж.ДокументРегистратор КАК ДокументРегистратор
	|ИЗ
	|	РегистрСведений.питУчетДанныхПродаж КАК УчетДанныхПродаж
	|ГДЕ
	|	(УчетДанныхПродаж.ДокументПриемник В (&СписокЦелевыхДокументов)
	|			ИЛИ УчетДанныхПродаж.ДокументРегистратор В (&СписокРегистраторов))
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетДанныхПродаж.ДокументРегистратор");
	Запрос.УстановитьПараметр("СписокЦелевыхДокументов",СписокЦелевыхДокументов);
	Запрос.УстановитьПараметр("СписокРегистраторов",СписокРегистраторов);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументРегистратор");
КонецФункции



// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"РезультатРаботы", НСтр("ru = 'Данные продаж фронта'"),
				ПечатьРезультатРаботы(МассивОбъектов, ПараметрыПечати),
				,
				"Обработка.питЗагрузкаRKeeper7.РезультатРаботы");
	КонецЕсли;
	
КонецПроцедуры



Функция ПечатьРезультатРаботы(МассивСохраненныхДокументов, СтруктураОбработанныхДокументов) Экспорт
	
	Если СтруктураОбработанныхДокументов.Свойство("МассивУдаленныхДокументов") Тогда
		МассивУдаленныхДокументов = СтруктураОбработанныхДокументов.МассивУдаленныхДокументов;
	Иначе
		МассивУдаленныхДокументов = Новый Массив;
	КонецЕсли;
	
	ТабДокумент	= Новый ТабличныйДокумент;
	ТабДокумент.Очистить();
	Макет = Обработки.питЗагрузкаИзДанныхПродажФронта.ПолучитьМакет("СозданныеДокументы");
	
	// Получим области
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	
	// Шапка
	ТабДокумент.Вывести(ОбластьШапка);
	// Список документов сохраненных
	Для Каждого ЦелевойДокумент Из МассивСохраненныхДокументов Цикл
		ОбластьСтрока.Параметры.ЦелевойДокумент = ЦелевойДокумент;
		ОбластьСтрока.Параметры.СостояниеВБазе = ?(ЦелевойДокумент.Проведен, "Проведен", "Записан");
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	// Список документов удаленных
	Для Каждого ЦелевойДокумент Из МассивУдаленныхДокументов Цикл
		ОбластьСтрока.Параметры.ЦелевойДокумент = ЦелевойДокумент;
		ОбластьСтрока.Параметры.СостояниеВБазе = "Помечен на удаление";
		ТабДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху          = 0;
	ТабДокумент.ПолеСлева           = 9;
	ТабДокумент.ПолеСправа          = 6;
	ТабДокумент.ПолеСнизу           = 0;
	ТабДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДокумент.ОтображатьЗаголовки	= Ложь;
	ТабДокумент.ОтображатьСетку     = Ложь;
	ТабДокумент.Защита              = Истина;
	ТабДокумент.ТолькоПросмотр      = Истина;
	
	Возврат ТабДокумент;
КонецФункции

#КонецЕсли
